# Data operations

## Read Data or Create Data

In [46]:
# Read data
# import os
# import pandas as pd
# # Get current working directory
# os.getcwd()
# # Change working directory
# os.chdir("/path/to/your/folder")
# # Read a CSV file in to a DataFrame
# df = pd.read_csv("data.csv")

In [47]:
# Create data
import pandas as pd

df = pd.DataFrame({
    'Name': [
        'Alice', 'Bob', 'Charlie', 'David', 'Eva',
        'Frank', 'Grace', 'Hannah', 'Ian', 'Julia',
        'Kevin', 'Laura', 'Michael', 'Nina'
    ],
    'Age': [25, 30, 35, 40, 28, 32, 29, 41, 35, 30,
            27, 33, 38, 26],
    'City': [
        'New York', 'Los Angeles', 'Chicago', 'New York', 'Los Angeles',
        'Chicago', 'New York', 'Los Angeles', 'New York', 'Los Angeles',
        'Chicago', 'New York', 'Los Angeles', 'New York'
    ],
    'Salary': [
        70000, 80000, 120000, 90000, 75000,
        120000, 70000, 80000, 90000, 75000,
        120000, 70000, 90000, 75000
    ]
})

print(df)

       Name  Age         City  Salary
0     Alice   25     New York   70000
1       Bob   30  Los Angeles   80000
2   Charlie   35      Chicago  120000
3     David   40     New York   90000
4       Eva   28  Los Angeles   75000
5     Frank   32      Chicago  120000
6     Grace   29     New York   70000
7    Hannah   41  Los Angeles   80000
8       Ian   35     New York   90000
9     Julia   30  Los Angeles   75000
10    Kevin   27      Chicago  120000
11    Laura   33     New York   70000
12  Michael   38  Los Angeles   90000
13     Nina   26     New York   75000

## Data Exploration and Inspection

In [48]:
df.head()

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   40     New York   90000
4      Eva   28  Los Angeles   75000

In [49]:
df.shape  # (rows, columns)

(14, 4)

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    14 non-null     object
 1   Age     14 non-null     int64
 2   City    14 non-null     object
 3   Salary  14 non-null     int64
dtypes: int64(2), object(2)
memory usage: 580.0+ bytes

In [51]:
df.describe()

             Age         Salary
count  14.000000      14.000000
mean   32.071429   87500.000000
std     5.136061   18988.863133
min    25.000000   70000.000000
25%    28.250000   75000.000000
50%    31.000000   80000.000000
75%    35.000000   90000.000000
max    41.000000  120000.000000

## Selecting Rows and Columns

In [52]:
# Select the first two rows and the last two columns
df.iloc[:2, -2:]

          City  Salary
0     New York   70000
1  Los Angeles   80000

In [53]:
# Select rows with index from 0 to 2 (inclusive) and only the 'City' column
df.loc[0:2, 'City']

0       New York
1    Los Angeles
2        Chicago
Name: City, dtype: object

In [54]:
# Select rows where City is "New York" and only keep Name and City columns
df_ny = df[df['City'] == 'New York'][['Name', 'City']]
print(df_ny)

     Name      City
0   Alice  New York
3   David  New York
6   Grace  New York
8     Ian  New York
11  Laura  New York
13   Nina  New York

In [55]:
# Select rows where Age > 30 AND Salary > 80000
df_high = df[(df['Age'] > 30) & (df['Salary'] > 80000)]
print(df_high)

       Name  Age         City  Salary
2   Charlie   35      Chicago  120000
3     David   40     New York   90000
5     Frank   32      Chicago  120000
8       Ian   35     New York   90000
12  Michael   38  Los Angeles   90000

## Merging and Concatenation

In [57]:
# Create copies of subsets where City is 'New York' and 'Los Angeles' respectively
df_ny = df[df['City'] == 'New York']
df_la = df[df['City'] == 'Los Angeles']

# Concatenate the two subsets vertically 
df_concat = pd.concat([df_ny, df_la]) # axis=0 is the default (stack rows), axis=1 would concatenate along columns
print(df_concat)

       Name  Age         City  Salary
0     Alice   25     New York   70000
3     David   40     New York   90000
6     Grace   29     New York   70000
8       Ian   35     New York   90000
11    Laura   33     New York   70000
13     Nina   26     New York   75000
1       Bob   30  Los Angeles   80000
4       Eva   28  Los Angeles   75000
7    Hannah   41  Los Angeles   80000
9     Julia   30  Los Angeles   75000
12  Michael   38  Los Angeles   90000

In [58]:
# Reset the index of the concatenated DataFrame to have a sequential index
df_concat = df_concat.reset_index(drop=True)
print(df_concat)

       Name  Age         City  Salary
0     Alice   25     New York   70000
1     David   40     New York   90000
2     Grace   29     New York   70000
3       Ian   35     New York   90000
4     Laura   33     New York   70000
5      Nina   26     New York   75000
6       Bob   30  Los Angeles   80000
7       Eva   28  Los Angeles   75000
8    Hannah   41  Los Angeles   80000
9     Julia   30  Los Angeles   75000
10  Michael   38  Los Angeles   90000

In [65]:
# Create a new data set including employee names, company names, and commute distances
# The new data set does NOT include the following four people: 'Kevin', 'Laura', 'Michael', 'Nina'
# Added three new people whose names start with 'O', 'P', and 'Q'
df2 = pd.DataFrame({
    'Name': [
        'Alice', 'Bob', 'Charlie', 'David', 'Eva',
        'Frank', 'Grace', 'Hannah', 'Ian', 'Julia',
        'Oliver', 'Pamela', 'Quentin' 
    ],
    'Company': [
        'Alpha Corp', 'Beta LLC', 'Gamma Inc', 'Alpha Corp', 'Beta LLC',
        'Gamma Inc', 'Alpha Corp', 'Beta LLC', 'Alpha Corp', 'Beta LLC',
        'Delta Co', 'Epsilon Ltd', 'Zeta Group' 
    ],
    'Commute_Miles': [
        5.2, 10.5, 3.3, 6.1, 9.4,
        4.8, 5.0, 11.0, 6.5, 9.9,
        7.1, 8.3, 6.7 
    ]
})

In [80]:
# Find names that are in either df or df2 but not in both (symmetric difference)
df_name = set(df['Name'])
df2_name = set(df2['Name'])

diff = df_name ^ df2_name
print("Difference:", diff)

Difference: {'Michael', 'Quentin', 'Oliver', 'Pamela', 'Kevin', 'Laura', 'Nina'}

In [66]:
df_merge_left = pd.merge(df, df2, how='left', on='Name') # Left merge means keep all rows from df (left DataFrame)
print(df.shape)
print(df2.shape)
print(df_merge_left.shape)

(14, 4)
(13, 3)
(14, 6)

In [70]:
# Compare the 'Name' column in the original df with the 'Name' column in df_merge_left
# This returns a boolean Series indicating which rows have matching names in both DataFrames
df['Name'] == df_merge_left['Name']

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
Name: Name, dtype: bool

In [71]:
# Perform an outer merge using 'Name' as the key
# Outer merge returns the union of rows from both df and df2
# For names missing in either DataFrame, the corresponding columns will have NaN (missing values)
df_merge_outer = pd.merge(df, df2, how='outer', on='Name')
print(df_merge_outer)

       Name   Age         City    Salary      Company  Commute_Miles
0     Alice  25.0     New York   70000.0   Alpha Corp            5.2
1       Bob  30.0  Los Angeles   80000.0     Beta LLC           10.5
2   Charlie  35.0      Chicago  120000.0    Gamma Inc            3.3
3     David  40.0     New York   90000.0   Alpha Corp            6.1
4       Eva  28.0  Los Angeles   75000.0     Beta LLC            9.4
5     Frank  32.0      Chicago  120000.0    Gamma Inc            4.8
6     Grace  29.0     New York   70000.0   Alpha Corp            5.0
7    Hannah  41.0  Los Angeles   80000.0     Beta LLC           11.0
8       Ian  35.0     New York   90000.0   Alpha Corp            6.5
9     Julia  30.0  Los Angeles   75000.0     Beta LLC            9.9
10    Kevin  27.0      Chicago  120000.0          NaN            NaN
11    Laura  33.0     New York   70000.0          NaN            NaN
12  Michael  38.0  Los Angeles   90000.0          NaN            NaN
13     Nina  26.0     New York   75000.0          NaN            NaN
14   Oliver   NaN          NaN       NaN     Delta Co            7.1
15   Pamela   NaN          NaN       NaN  Epsilon Ltd            8.3
16  Quentin   NaN          NaN       NaN   Zeta Group            6.7

In [76]:
# Calculate the mean of the 'Commute_Miles' column (ignoring NaN values)
mean_value = df_merge_outer['Commute_Miles'].mean()

# Fill missing values (NaN) in 'Commute_Miles' with the calculated mean
df_merge_outer['Commute_Miles'] = df_merge_outer['Commute_Miles'].fillna(mean_value)

print(df_merge_outer)

       Name   Age         City    Salary      Company  Commute_Miles
0     Alice  25.0     New York   70000.0   Alpha Corp       5.200000
1       Bob  30.0  Los Angeles   80000.0     Beta LLC      10.500000
2   Charlie  35.0      Chicago  120000.0    Gamma Inc       3.300000
3     David  40.0     New York   90000.0   Alpha Corp       6.100000
4       Eva  28.0  Los Angeles   75000.0     Beta LLC       9.400000
5     Frank  32.0      Chicago  120000.0    Gamma Inc       4.800000
6     Grace  29.0     New York   70000.0   Alpha Corp       5.000000
7    Hannah  41.0  Los Angeles   80000.0     Beta LLC      11.000000
8       Ian  35.0     New York   90000.0   Alpha Corp       6.500000
9     Julia  30.0  Los Angeles   75000.0     Beta LLC       9.900000
10    Kevin  27.0      Chicago  120000.0          NaN       7.215385
11    Laura  33.0     New York   70000.0          NaN       7.215385
12  Michael  38.0  Los Angeles   90000.0          NaN       7.215385
13     Nina  26.0     New York   75000.0          NaN       7.215385
14   Oliver   NaN          NaN       NaN     Delta Co       7.100000
15   Pamela   NaN          NaN       NaN  Epsilon Ltd       8.300000
16  Quentin   NaN          NaN       NaN   Zeta Group       6.700000

## Grouping and Aggregation

In [84]:
# Make a copy of df_merge_outer to avoid modifying the original DataFrame
df_merge = df_merge_outer.copy()

# Drop rows with any missing values (NaN)
df_clean = df_merge.dropna()

print("Shape before dropping rows with missing values:", df_merge.shape)
print("Shape after dropping rows with missing values:", df_clean.shape)

Shape before dropping rows with missing values: (17, 6)
Shape after dropping rows with missing values: (10, 6)

In [85]:
print(df_clean)

      Name   Age         City    Salary     Company  Commute_Miles
0    Alice  25.0     New York   70000.0  Alpha Corp            5.2
1      Bob  30.0  Los Angeles   80000.0    Beta LLC           10.5
2  Charlie  35.0      Chicago  120000.0   Gamma Inc            3.3
3    David  40.0     New York   90000.0  Alpha Corp            6.1
4      Eva  28.0  Los Angeles   75000.0    Beta LLC            9.4
5    Frank  32.0      Chicago  120000.0   Gamma Inc            4.8
6    Grace  29.0     New York   70000.0  Alpha Corp            5.0
7   Hannah  41.0  Los Angeles   80000.0    Beta LLC           11.0
8      Ian  35.0     New York   90000.0  Alpha Corp            6.5
9    Julia  30.0  Los Angeles   75000.0    Beta LLC            9.9

In [88]:
# Calculate the overall average Age and Salary for all employees
average_age = df_clean['Age'].mean()
average_salary = df_clean['Salary'].mean()
print(f"Overall average Age: {average_age:.2f}")
print(f"Overall average Salary: ${average_salary:,.2f}")

Overall average Age: 32.50
Overall average Salary: $87,000.00

In [89]:
# Calculate the average Salary and Commute_Miles for each Company
company_stats = df_clean.groupby('Company')[['Salary', 'Commute_Miles']].mean()
print("\nAverage Salary and Commute Miles by Company:")
print(company_stats)

Average Salary and Commute Miles by Company:
              Salary  Commute_Miles
Company
Alpha Corp   80000.0           5.70
Beta LLC     77500.0          10.20
Gamma Inc   120000.0           4.05